Revit 2026 API

# MEPCurveHeight Property

---

The height of the MEP curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; }
```
```vb
Public ReadOnly Property Height As Double
	Get
```
```cpp
public:
property double Height {
	double get ();
}
```
```fsharp
member Height : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the MEP curve's Shape is not rectangular. |

This property is used to retrieve the height of the MEP curve.

#### Reference

MEPCurve Class

Autodesk.Revit.DB Namespace